In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [10]:
df=pd.read_csv('album2.csv')

In [11]:
df.head()

   album_id                                  title  artist_id
0         1  For Those About To Rock We Salute You          1
1         2                      Balls to the Wall          2
2         3                      Restless and Wild          2
3         4                      Let There Be Rock          1
4         5                               Big Ones          3

In [21]:
df.shape

(347, 3)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347 entries, 0 to 346
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   album_id   347 non-null    int64
 1   title      347 non-null    object
 2   artist_id  347 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.3+ KB

In [12]:
df.isnull().sum()

album_id     0
title        0
artist_id    0
dtype: int64

In [13]:
df.duplicated().sum()

0

In [14]:
df.to_csv('album2.csv')

In [15]:
df=pd.read_csv('artist.csv')

In [23]:
df.head()

   artist_id               name
0          1              AC/DC
1          2             Accept
2          3          Aerosmith
3          4  Alanis Morissette
4          5    Alice In Chains

In [24]:
df.shape

(275, 2)

In [16]:
df.isnull().sum()

artist_id    0
name         0
dtype: int64

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 275 entries, 0 to 274
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   artist_id  275 non-null    int64
 1   name       275 non-null    object
dtypes: int64(1), object(1)
memory usage: 4.4+ KB

In [18]:
df.duplicated().sum()

0

In [19]:
df.to_csv('artist.csv')

In [20]:
df=pd.read_csv('customer.csv')

In [31]:
df.head()

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,NaN,Theodor-Heuss-Straße 34,Stuttgart,NaN,Germany,70174,+49 0711 2842222,NaN,leonekohler@surfeu.de,5
2,3,François,Tremblay,NaN,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,NaN,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,NaN,Ullevålsveien 14,Oslo,NaN,Norway,171,+47 22 44 22 22,NaN,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,NaN,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     59 non-null     int64
 1   first_name      59 non-null     object
 2   last_name       59 non-null     object
 3   company         10 non-null     object
 4   address         59 non-null     object
 5   city            59 non-null     object
 6   state           30 non-null     object
 7   country         59 non-null     object
 8   postal_code     55 non-null     object
 9   phone           58 non-null     object
 10  fax             12 non-null     object
 11  email           59 non-null     object
 12  support_rep_id  59 non-null     int64
dtypes: int64(2), object(11)
memory usage: 6.1+ KB

In [21]:
df.isnull().sum()

customer_id        0
first_name         0
last_name          0
company           49
address            0
city               0
state             29
country            0
postal_code        4
phone              1
fax               47
email              0
support_rep_id     0
dtype: int64

In [22]:
df.dropna(inplace=True)

In [23]:
df.isnull().sum()

customer_id       0
first_name        0
last_name         0
company           0
address           0
city              0
state             0
country           0
postal_code       0
phone             0
fax               0
email             0
support_rep_id    0
dtype: int64

In [24]:
df.duplicated().sum()

0

In [25]:
df.to_csv('customer.csv')

In [3]:
df=pd.read_csv('employee.csv')

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  9 non-null      int64
 1   last_name    9 non-null      object
 2   first_name   9 non-null      object
 3   title        9 non-null      object
 4   reports_to   8 non-null      float64
 5   levels       9 non-null      object
 6   birthdate    9 non-null      object
 7   hire_date    9 non-null      object
 8   address      9 non-null      object
 9   city         9 non-null      object
 10  state        9 non-null      object
 11  country      9 non-null      object
 12  postal_code  9 non-null      object
 13  phone        9 non-null      object
 14  fax          9 non-null      object
 15  email        9 non-null      object
dtypes: float64(1), int64(1), object(14)
memory usage: 1.3+ KB

In [42]:
df.head()

,employee_id,last_name,first_name,title,reports_to,levels,birthdate,hire_date,address,city,state,country,postal_code,phone,fax,email
0,1,Adams,Andrew,General Manager,9.0,L6,18-02-1962 00:00,14-08-2016 00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,L4,08-12-1958 00:00,01-05-2016 00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,L1,29-08-1973 00:00,01-04-2017 00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,L1,19-09-1947 00:00,03-05-2017 00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,L1,03-03-1965 00:00,17-10-2017 00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [5]:
df.isnull().sum()

employee_id    0
last_name      0
first_name     0
title          0
reports_to     1
levels         0
birthdate      0
hire_date      0
address        0
city           0
state          0
country        0
postal_code    0
phone          0
fax            0
email          0
dtype: int64

In [6]:
df.drop(columns=['reports_to'], inplace=True)

In [7]:
df.drop(columns=['fax'], inplace=True)

In [48]:
df.head()

,employee_id,last_name,first_name,title,levels,birthdate,hire_date,address,city,state,country,postal_code,phone,email
0,1,Adams,Andrew,General Manager,L6,18-02-1962 00:00,14-08-2016 00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,L4,08-12-1958 00:00,01-05-2016 00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,L1,29-08-1973 00:00,01-04-2017 00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,L1,19-09-1947 00:00,03-05-2017 00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,L1,03-03-1965 00:00,17-10-2017 00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,steve@chinookcorp.com

In [8]:
df.duplicated().sum()

0

In [9]:
df.to_csv('employee.csv')

In [26]:
df=pd.read_csv('genre.csv')

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   genre_id  25 non-null     int64
 1   name      25 non-null     object
dtypes: int64(1), object(1)
memory usage: 532.0+ bytes

In [52]:
df.head()

   genre_id                name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll

In [27]:
df.isnull().sum()

genre_id    0
name        0
dtype: int64

In [28]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
dtype: bool

In [29]:
df.to_csv('genre.csv')

In [62]:
df=pd.read_csv('invoice_line.csv')

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4757 entries, 0 to 4756
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   invoice_line_id  4757 non-null   int64
 1   invoice_id       4757 non-null   int64
 2   track_id         4757 non-null   int64
 3   unit_price       4757 non-null   float64
 4   quantity         4757 non-null   int64
dtypes: float64(1), int64(4)
memory usage: 185.9 KB

In [65]:
df.head()

   Unnamed: 0  invoice_line_id  invoice_id  track_id  unit_price  quantity
0           0                1           1      1158        0.99         1
1           1                2           1      1159        0.99         1
2           2                3           1      1160        0.99         1
3           3                4           1      1161        0.99         1
4           4                5           1      1162        0.99         1

In [64]:
df.isnull().sum()

Unnamed: 0         0
invoice_line_id    0
invoice_id         0
track_id           0
unit_price         0
quantity           0
dtype: int64

In [32]:
df.duplicated().sum()

0

In [33]:
df.to_csv('invoice_line.csv')

In [66]:
df=pd.read_csv('invoice.csv')

In [35]:
df.isnull().sum()

invoice_id               0
customer_id              0
invoice_date             0
billing_address          0
billing_city             0
billing_state          304
billing_country          0
billing_postal_code     55
total                    0
dtype: int64

In [36]:
df.dropna(inplace=True)

In [67]:
df.isnull().sum()

Unnamed: 0             0
invoice_id             0
customer_id            0
invoice_date           0
billing_address        0
billing_city           0
billing_state          0
billing_country        0
billing_postal_code    0
total                  0
dtype: int64

In [38]:
df.duplicated().sum()

0

In [40]:
df.to_csv('invoice.csv')

In [41]:
df=pd.read_csv('media_type.csv')

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   media_type_id  5 non-null      int64
 1   name           5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [69]:
df.head()

   media_type_id                         name
0              1              MPEG audio file
1              2     Protected AAC audio file
2              3  Protected MPEG-4 video file
3              4     Purchased AAC audio file
4              5               AAC audio file

In [42]:
df.isnull().sum()

media_type_id    0
name             0
dtype: int64

In [43]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [44]:
df.to_csv('media_type.csv')

In [45]:
df=pd.read_csv('playlist_track.csv')

In [46]:
df.isnull().sum()

playlist_id    0
track_id       0
dtype: int64

In [47]:
df.duplicated().sum()

0

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8715 entries, 0 to 8714
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   playlist_id  8715 non-null   int64
 1   track_id     8715 non-null   int64
dtypes: int64(2)
memory usage: 136.3 KB

In [76]:
df.shape

(8715, 2)

In [48]:
df.to_csv('playlist_track.csv')

In [68]:
df=pd.read_csv('playlist.csv')

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   playlist_id  18 non-null     int64
 1   name         18 non-null     object
dtypes: int64(1), object(1)
memory usage: 420.0+ bytes

In [69]:
df.head()

   playlist_id        name
0            1       Music
1            2      Movies
2            3    TV Shows
3            4  Audiobooks
4            5  90’s Music

In [50]:
df.isnull().sum()

playlist_id    0
name           0
dtype: int64

In [51]:
df.duplicated().sum()

0

In [52]:
df.to_csv('playlist.csv.csv')

In [53]:
df=pd.read_csv('track.csv')

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3503 entries, 0 to 3502
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   track_id       3503 non-null   int64
 1   name           3503 non-null   object
 2   album_id       3503 non-null   int64
 3   media_type_id  3503 non-null   int64
 4   genre_id       3503 non-null   int64
 5   composer       2525 non-null   object
 6   milliseconds   3503 non-null   int64
 7   bytes          3503 non-null   int64
 8   unit_price     3503 non-null   float64
dtypes: float64(1), int64(6), object(2)
memory usage: 246.4+ KB

In [54]:
df.isnull().sum()

track_id           0
name               0
album_id           0
media_type_id      0
genre_id           0
composer         978
milliseconds       0
bytes              0
unit_price         0
dtype: int64

In [55]:
df.dropna(inplace=True)

In [56]:
df.isnull().sum()

track_id         0
name             0
album_id         0
media_type_id    0
genre_id         0
composer         0
milliseconds     0
bytes            0
unit_price       0
dtype: int64

In [57]:
df.duplicated().sum()

0

In [58]:
df.to_csv('track.csv')